*** metao-kernel/src/lib.rs:25:8: delete ! in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ delete ! in evaluate_acceptance
@@ -17,17 +17,17 @@
     if !matches!(result.status, ExecutionStatus::Succeeded) {
         return AcceptanceDecision::NotDone;
     }
 
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
-    if !evidence.verified
+    if  /* ~ changed by cargo-mutants ~ */evidence.verified
         || evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }

---- tests::unverified_evidence_with_exact_binding_is_blocked stdout ----

thread 'tests::unverified_evidence_with_exact_binding_is_blocked' (8744) panicked at metao-kernel\src\lib.rs:93:9:
assertion `left == right` failed
  left: Accept
 right: Block

failures:
    tests::unverified_evidence_with_exact_binding_is_blocked

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
