*** metao-kernel/src/lib.rs:26:9: replace || with && in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace || with && in evaluate_acceptance
@@ -18,17 +18,17 @@
         return AcceptanceDecision::NotDone;
     }
 
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
     if !evidence.verified
-        || evidence.mission_id != request.mission_id
+        && /* ~ changed by cargo-mutants ~ */ evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch {

---- tests::unverified_evidence_with_exact_binding_is_blocked stdout ----

thread 'tests::unverified_evidence_with_exact_binding_is_blocked' (18368) panicked at metao-kernel\src\lib.rs:93:9:
assertion `left == right` failed
  left: Accept
 right: Block

failures:
    tests::unverified_evidence_with_exact_binding_is_blocked

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
