*** metao-kernel/src/lib.rs:48:27: delete ! in reconcile_missing

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ delete ! in reconcile_missing
@@ -40,17 +40,17 @@
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired
         .iter()
-        .filter(|runtime| !observed.contains(runtime))
+        .filter(|runtime|  /* ~ changed by cargo-mutants ~ */observed.contains(runtime))
         .cloned()
         .collect();
     missing.sort();
     missing.dedup();
     missing
 }
 
 #[cfg(test)]

---- exhaustive_small_reconcile_state_space_satisfies_laws stdout ----

thread 'exhaustive_small_reconcile_state_space_satisfies_laws' (5792) panicked at metao-testkit\tests\qualification.rs:601:13:
assertion failed: first.iter().all(|r| desired.contains(r) && !observed.contains(r))

---- reconciliation_is_idempotent_and_deterministic stdout ----

thread 'reconciliation_is_idempotent_and_deterministic' (22700) panicked at metao-testkit\tests\qualification.rs:566:5:
assertion `left == right` failed
  left: [RuntimeId("alpha")]
 right: [RuntimeId("beta")]

failures:
    exhaustive_small_reconcile_state_space_satisfies_laws
    reconciliation_is_idempotent_and_deterministic

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.91s

*** result: Failure(101)
