*** metao-kernel/src/lib.rs:17:8: delete ! in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ delete ! in evaluate_acceptance
@@ -9,17 +9,17 @@
     evidence: Option<&Evidence>,
     policy: PolicyEffect,
     now_epoch: i64,
 ) -> AcceptanceDecision {
     if matches!(policy, PolicyEffect::Deny) {
         return AcceptanceDecision::Block;
     }
 
-    if !matches!(result.status, ExecutionStatus::Succeeded) {
+    if  /* ~ changed by cargo-mutants ~ */matches!(result.status, ExecutionStatus::Succeeded) {
         return AcceptanceDecision::NotDone;
     }
 
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
     if !evidence.verified

---- acceptance_binding_requires_exact_runtime_and_result_alignment stdout ----

thread 'acceptance_binding_requires_exact_runtime_and_result_alignment' (10312) panicked at metao-testkit\tests\qualification.rs:343:5:
assertion `left == right` failed
  left: NotDone
 right: Block

---- acceptance_boundary_epochs_match_python_oracle stdout ----

thread 'acceptance_boundary_epochs_match_python_oracle' (20188) panicked at metao-testkit\tests\qualification.rs:311:5:
assertion `left == right` failed
  left: NotDone
 right: Accept

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (20984) panicked at metao-testkit\tests\qualification.rs:271:5:
assertion `left == right` failed
  left: NotDone
 right: Accept

failures:
    acceptance_binding_requires_exact_runtime_and_result_alignment
    acceptance_boundary_epochs_match_python_oracle
    acceptance_hard_gates_match_python_baseline
    adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding
    failed_execution_never_accepts_and_panic_is_contained
    fault_injection_endurance_slice_contains_failure_and_recovers
    replays_python_golden_fixture_outcomes

test result: FAILED. 7 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
