*** metao-kernel/src/lib.rs:29:9: replace || with && in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace || with && in evaluate_acceptance
@@ -21,17 +21,17 @@
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
     if !evidence.verified
         || evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
-        || evidence.runtime_id != result.runtime_id
+        && /* ~ changed by cargo-mutants ~ */ evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch {
         return AcceptanceDecision::Block;
     }

---- adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding stdout ----

thread 'adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding' (4596) panicked at metao-testkit\tests\qualification.rs:417:21:
assertion `left == right` failed
  left: true
 right: false

---- acceptance_binding_requires_exact_runtime_and_result_alignment stdout ----

thread 'acceptance_binding_requires_exact_runtime_and_result_alignment' (19188) panicked at metao-testkit\tests\qualification.rs:343:5:
assertion `left == right` failed
  left: Accept
 right: Block

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (8544) panicked at metao-testkit\tests\qualification.rs:291:5:
assertion `left == right` failed
  left: Accept
 right: Block

failures:
    acceptance_binding_requires_exact_runtime_and_result_alignment
    acceptance_hard_gates_match_python_baseline
    adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.83s

*** result: Failure(101)
