*** metao-kernel/src/lib.rs:38:18: replace > with == in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace > with == in evaluate_acceptance
@@ -30,17 +30,17 @@
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch {
         return AcceptanceDecision::Block;
     }
 
-    if now_epoch > evidence.expires_at_epoch {
+    if now_epoch == /* ~ changed by cargo-mutants ~ */ evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (19572) panicked at metao-testkit\tests\qualification.rs:281:5:
assertion `left == right` failed
  left: Accept
 right: Stale

---- acceptance_boundary_epochs_match_python_oracle stdout ----

thread 'acceptance_boundary_epochs_match_python_oracle' (1044) panicked at metao-testkit\tests\qualification.rs:324:5:
assertion `left == right` failed
  left: Stale
 right: Accept

---- replays_python_golden_fixture_outcomes stdout ----

thread 'replays_python_golden_fixture_outcomes' (23692) panicked at metao-testkit\tests\qualification.rs:386:9:
assertion `left == right` failed: golden case stale_evidence executor_done=false drifted
  left: Accept
 right: Stale

failures:
    acceptance_boundary_epochs_match_python_oracle
    acceptance_hard_gates_match_python_baseline
    replays_python_golden_fixture_outcomes

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.76s

*** result: Failure(101)
