*** metao-kernel/src/lib.rs:38:18: replace > with < in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace > with < in evaluate_acceptance
@@ -30,17 +30,17 @@
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch {
         return AcceptanceDecision::Block;
     }
 
-    if now_epoch > evidence.expires_at_epoch {
+    if now_epoch < /* ~ changed by cargo-mutants ~ */ evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired

---- acceptance_boundary_epochs_match_python_oracle stdout ----

thread 'acceptance_boundary_epochs_match_python_oracle' (8620) panicked at metao-testkit\tests\qualification.rs:311:5:
assertion `left == right` failed
  left: Stale
 right: Accept

---- adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding stdout ----

thread 'adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding' (13204) panicked at metao-testkit\tests\qualification.rs:417:21:
assertion `left == right` failed
  left: false
 right: true

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (6948) panicked at metao-testkit\tests\qualification.rs:271:5:
assertion `left == right` failed
  left: Stale
 right: Accept

failures:
    acceptance_boundary_epochs_match_python_oracle
    acceptance_hard_gates_match_python_baseline
    adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding
    fault_injection_endurance_slice_contains_failure_and_recovers
    replays_python_golden_fixture_outcomes

test result: FAILED. 9 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.95s

*** result: Failure(101)
