*** metao-kernel/src/lib.rs:38:18: replace > with >= in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace > with >= in evaluate_acceptance
@@ -30,17 +30,17 @@
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch {
         return AcceptanceDecision::Block;
     }
 
-    if now_epoch > evidence.expires_at_epoch {
+    if now_epoch >= /* ~ changed by cargo-mutants ~ */ evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired

---- acceptance_boundary_epochs_match_python_oracle stdout ----

thread 'acceptance_boundary_epochs_match_python_oracle' (10208) panicked at metao-testkit\tests\qualification.rs:324:5:
assertion `left == right` failed
  left: Stale
 right: Accept

failures:
    acceptance_boundary_epochs_match_python_oracle

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.79s

*** result: Failure(101)
