*** metao-kernel/src/lib.rs:46:5: replace reconcile_missing -> Vec<RuntimeId> with vec![]

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace reconcile_missing -> Vec<RuntimeId> with vec![]
@@ -38,17 +38,10 @@
     if now_epoch > evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
-    let mut missing: Vec<_> = desired
-        .iter()
-        .filter(|runtime| !observed.contains(runtime))
-        .cloned()
-        .collect();
-    missing.sort();
-    missing.dedup();
-    missing
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

---- reconciliation_is_idempotent_and_deterministic stdout ----

thread 'reconciliation_is_idempotent_and_deterministic' (3400) panicked at metao-testkit\tests\qualification.rs:559:5:
assertion `left == right` failed
  left: []
 right: [RuntimeId("beta")]

failures:
    reconciliation_is_idempotent_and_deterministic

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.96s

*** result: Failure(101)
