*** metao-kernel/src/lib.rs:27:9: replace || with && in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace || with && in evaluate_acceptance
@@ -19,17 +19,17 @@
     }
 
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
     if !evidence.verified
         || evidence.mission_id != request.mission_id
-        || evidence.execution_id != request.execution_id
+        && /* ~ changed by cargo-mutants ~ */ evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch || now_epoch > evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;

---- adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding stdout ----

thread 'adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding' (18208) panicked at metao-testkit\tests\qualification.rs:321:21:
assertion `left == right` failed
  left: true
 right: false

failures:
    adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
