*** metao-kernel/src/lib.rs:28:34: replace != with == in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace != with == in evaluate_acceptance
@@ -20,17 +20,17 @@
 
     let Some(evidence) = evidence else {
         return AcceptanceDecision::NotDone;
     };
 
     if !evidence.verified
         || evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
-        || evidence.execution_id != result.execution_id
+        || evidence.execution_id == /* ~ changed by cargo-mutants ~ */ result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
     if now_epoch < evidence.created_at_epoch || now_epoch > evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (13436) panicked at metao-testkit\tests\qualification.rs:235:5:
assertion `left == right` failed
  left: Block
 right: Accept

---- adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding stdout ----

thread 'adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding' (23088) panicked at metao-testkit\tests\qualification.rs:321:21:
assertion `left == right` failed
  left: false
 right: true

---- replays_python_golden_fixture_outcomes stdout ----

thread 'replays_python_golden_fixture_outcomes' (19256) panicked at metao-testkit\tests\qualification.rs:290:9:
assertion `left == right` failed: golden case bound_verified_evidence executor_done=false drifted
  left: Block
 right: Accept

failures:
    acceptance_hard_gates_match_python_baseline
    adversarial_evidence_binding_matrix_only_accepts_exact_verified_binding
    replays_python_golden_fixture_outcomes

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
