*** metao-kernel/src/lib.rs:34:59: replace > with == in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace > with == in evaluate_acceptance
@@ -26,17 +26,17 @@
         || evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
-    if now_epoch < evidence.created_at_epoch || now_epoch > evidence.expires_at_epoch {
+    if now_epoch < evidence.created_at_epoch || now_epoch == /* ~ changed by cargo-mutants ~ */ evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired

---- acceptance_hard_gates_match_python_baseline stdout ----

thread 'acceptance_hard_gates_match_python_baseline' (17868) panicked at metao-testkit\tests\qualification.rs:245:5:
assertion `left == right` failed
  left: Accept
 right: Stale

---- replays_python_golden_fixture_outcomes stdout ----

thread 'replays_python_golden_fixture_outcomes' (24448) panicked at metao-testkit\tests\qualification.rs:290:9:
assertion `left == right` failed: golden case stale_evidence executor_done=false drifted
  left: Accept
 right: Stale

failures:
    acceptance_hard_gates_match_python_baseline
    replays_python_golden_fixture_outcomes

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
