*** metao-registry/src/lib.rs:30:9: replace Registry::register -> Result<(), RegistryError> with Ok(())

*** mutation diff:
--- metao-registry/src/lib.rs
+++ replace Registry::register -> Result<(), RegistryError> with Ok(())
@@ -22,31 +22,17 @@
 
 #[derive(Default)]
 pub struct Registry {
     runtimes: HashMap<RuntimeId, RegisteredRuntime>,
 }
 
 impl Registry {
     pub fn register(&mut self, runtime: Box<dyn Orchestrator>) -> Result<(), RegistryError> {
-        let id = runtime.id();
-        let version = runtime.version();
-        if let Some(existing) = self.runtimes.get(&id) {
-            if existing.version == version {
-                return Err(RegistryError::Duplicate(id));
-            }
-            return Err(RegistryError::VersionConflict {
-                id,
-                existing: existing.version.clone(),
-                incoming: version,
-            });
-        }
-        self.runtimes
-            .insert(id, RegisteredRuntime { version, runtime });
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn unregister(&mut self, id: &RuntimeId) -> bool {
         self.runtimes.remove(id).is_some()
     }
 
     pub fn execute_contained(
         &self,

---- duplicate_and_version_conflict_fail_deterministically stdout ----

thread 'duplicate_and_version_conflict_fail_deterministically' (22748) panicked at metao-testkit\tests\qualification.rs:189:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(Duplicate(RuntimeId("alpha")))

---- failed_execution_never_accepts_and_panic_is_contained stdout ----

thread 'failed_execution_never_accepts_and_panic_is_contained' (24492) panicked at metao-testkit\tests\qualification.rs:350:5:
assertion `left == right` failed
  left: Err(NotFound(RuntimeId("panic")))
 right: Err(Panicked(RuntimeId("panic")))

---- unregister_reports_presence_and_removal stdout ----

thread 'unregister_reports_presence_and_removal' (2404) panicked at metao-testkit\tests\qualification.rs:360:5:
assertion failed: registry.unregister(&runtime_id("alpha"))

failures:
    duplicate_and_version_conflict_fail_deterministically
    failed_execution_never_accepts_and_panic_is_contained
    unregister_reports_presence_and_removal
    whole_orchestrator_replacement_changes_no_kernel_contract

test result: FAILED. 7 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
