*** metao-registry/src/lib.rs:48:9: replace Registry::unregister -> bool with true

*** mutation diff:
--- metao-registry/src/lib.rs
+++ replace Registry::unregister -> bool with true
@@ -40,17 +40,17 @@
             });
         }
         self.runtimes
             .insert(id, RegisteredRuntime { version, runtime });
         Ok(())
     }
 
     pub fn unregister(&mut self, id: &RuntimeId) -> bool {
-        self.runtimes.remove(id).is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn execute_contained(
         &self,
         id: &RuntimeId,
         request: &ExecutionRequest,
     ) -> Result<ExecutionResult, RegistryError> {
         let Some(registered) = self.runtimes.get(id) else {

---- unregister_reports_presence_and_removal stdout ----

thread 'unregister_reports_presence_and_removal' (4484) panicked at metao-testkit\tests\qualification.rs:361:5:
assertion failed: !registry.unregister(&runtime_id("alpha"))

failures:
    unregister_reports_presence_and_removal

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
