*** metao-registry/src/lib.rs:48:9: replace Registry::unregister -> bool with false

*** mutation diff:
--- metao-registry/src/lib.rs
+++ replace Registry::unregister -> bool with false
@@ -40,17 +40,17 @@
             });
         }
         self.runtimes
             .insert(id, RegisteredRuntime { version, runtime });
         Ok(())
     }
 
     pub fn unregister(&mut self, id: &RuntimeId) -> bool {
-        self.runtimes.remove(id).is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn execute_contained(
         &self,
         id: &RuntimeId,
         request: &ExecutionRequest,
     ) -> Result<ExecutionResult, RegistryError> {
         let Some(registered) = self.runtimes.get(id) else {

---- unregister_reports_presence_and_removal stdout ----

thread 'unregister_reports_presence_and_removal' (3028) panicked at metao-testkit\tests\qualification.rs:360:5:
assertion failed: registry.unregister(&runtime_id("alpha"))

---- whole_orchestrator_replacement_changes_no_kernel_contract stdout ----

thread 'whole_orchestrator_replacement_changes_no_kernel_contract' (17056) panicked at metao-testkit\tests\qualification.rs:174:5:
assertion failed: registry.unregister(&runtime_id("alpha"))

failures:
    unregister_reports_presence_and_removal
    whole_orchestrator_replacement_changes_no_kernel_contract

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
