*** metao-kernel/src/lib.rs:34:18: replace < with == in evaluate_acceptance

*** mutation diff:
--- metao-kernel/src/lib.rs
+++ replace < with == in evaluate_acceptance
@@ -26,17 +26,17 @@
         || evidence.mission_id != request.mission_id
         || evidence.execution_id != request.execution_id
         || evidence.execution_id != result.execution_id
         || evidence.runtime_id != result.runtime_id
     {
         return AcceptanceDecision::Block;
     }
 
-    if now_epoch < evidence.created_at_epoch || now_epoch > evidence.expires_at_epoch {
+    if now_epoch == /* ~ changed by cargo-mutants ~ */ evidence.created_at_epoch || now_epoch > evidence.expires_at_epoch {
         return AcceptanceDecision::Stale;
     }
 
     AcceptanceDecision::Accept
 }
 
 pub fn reconcile_missing(desired: &[RuntimeId], observed: &[RuntimeId]) -> Vec<RuntimeId> {
     let mut missing: Vec<_> = desired

*** result: Success
