*** metao-registry/src/lib.rs:33:33: replace == with != in Registry::register

*** mutation diff:
--- metao-registry/src/lib.rs
+++ replace == with != in Registry::register
@@ -25,17 +25,17 @@
     runtimes: HashMap<RuntimeId, RegisteredRuntime>,
 }
 
 impl Registry {
     pub fn register(&mut self, runtime: Box<dyn Orchestrator>) -> Result<(), RegistryError> {
         let id = runtime.id();
         let version = runtime.version();
         if let Some(existing) = self.runtimes.get(&id) {
-            if existing.version == version {
+            if existing.version != /* ~ changed by cargo-mutants ~ */ version {
                 return Err(RegistryError::Duplicate(id));
             }
             return Err(RegistryError::VersionConflict {
                 id,
                 existing: existing.version.clone(),
                 incoming: version,
             });
         }

---- duplicate_and_version_conflict_fail_deterministically stdout ----

thread 'duplicate_and_version_conflict_fail_deterministically' (17832) panicked at metao-testkit\tests\qualification.rs:189:5:
assertion `left == right` failed
  left: Err(VersionConflict { id: RuntimeId("alpha"), existing: "1", incoming: "1" })
 right: Err(Duplicate(RuntimeId("alpha")))

failures:
    duplicate_and_version_conflict_fail_deterministically

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
